import { implementLayer } from '@antv/li-sdk';
import React from 'react';
import component from './Component';
import registerForm from './register-form';

const TMSICON = (
  <svg viewBox="0 0 56 56" width="56px" height="56px" style={{ fill: 'currentcolor' }}>
    <path d="m27.55,22.84L1.87,37.3l26.58,14.97,25.68-14.46-26.58-14.97Z" style={{ opacity: 0.6 }} />
    <path d="m27.55,14.32L1.87,28.78l26.58,14.97,25.68-14.46-26.58-14.97Z" style={{ opacity: 0.6 }} />
    <path d="m27.55,3.73L1.87,18.19l26.58,14.97,25.68-14.46L27.55,3.73Z" style={{ opacity: 0.6 }} />
    <path d="m11.06,24.01h8.74v2.3h-2.93v7.01h-2.88v-7.01h-2.93v-2.3Z" fill="#c0c0c0" />
    <path
      d="m22.44,24.01h3.78l1.46,5.66,1.45-5.66h3.78v9.31h-2.35v-7.1l-1.81,7.1h-2.13l-1.81-7.1v7.1h-2.35v-9.31Z"
      fill="#c0c0c0"
    />
    <path
      d="m35.6,30.24l2.74-.17c.06.44.18.78.36,1.02.3.38.72.56,1.27.56.41,0,.73-.1.95-.29.22-.19.33-.42.33-.67s-.11-.46-.32-.65c-.21-.19-.7-.37-1.47-.54-1.26-.28-2.16-.66-2.7-1.13-.54-.47-.81-1.07-.81-1.8,0-.48.14-.93.42-1.36.28-.42.69-.76,1.25-1,.56-.24,1.32-.36,2.29-.36,1.19,0,2.1.22,2.72.66.62.44,1,1.15,1.11,2.11l-2.71.16c-.07-.42-.22-.72-.45-.91s-.55-.29-.96-.29c-.33,0-.59.07-.76.21-.17.14-.25.31-.25.52,0,.15.07.28.21.4.14.12.46.24.96.34,1.26.27,2.16.54,2.7.82.54.28.94.62,1.19,1.03.25.41.37.87.37,1.38,0,.6-.16,1.15-.49,1.65-.33.5-.79.89-1.38,1.15-.59.26-1.34.39-2.24.39-1.58,0-2.68-.3-3.29-.91s-.95-1.38-1.03-2.32Z"
      fill="#c0c0c0"
    />
  </svg>
);

const ICON = () => (
  <svg viewBox="0 0 56 56" width="56px" height="56px" style={{ fill: 'currentcolor' }}>
    <path d="m27.55,22.84L1.87,37.3l26.58,14.97,25.68-14.46-26.58-14.97Z" style={{ opacity: 0.6 }} />
    <path d="m27.55,14.32L1.87,28.78l26.58,14.97,25.68-14.46-26.58-14.97Z" style={{ opacity: 0.6 }} />
    <path d="m27.55,3.73L1.87,18.19l26.58,14.97,25.68-14.46L27.55,3.73Z" style={{ opacity: 0.6 }} />
    <path
      d="m9.93,20.28h3.17l1.65,2.86,1.6-2.86h3.14l-2.9,4.51,3.17,4.8h-3.23l-1.84-2.99-1.84,2.99h-3.21l3.21-4.85-2.92-4.46Z"
      fill="#c0c0c0"
    />
    <path d="m21.1,20.28h3.19l1.88,3.14,1.88-3.14h3.18l-3.62,5.41v3.9h-2.88v-3.9l-3.62-5.41Z" fill="#c0c0c0" />
    <path d="m33.28,20.28h8.14v1.86l-5.22,5.45h5.41v2h-8.83v-1.93l5.17-5.39h-4.67v-1.99Z" fill="#c0c0c0" />
  </svg>
);

export default implementLayer({
  version: 'v0.1',
  metadata: {
    name: 'TileLayer',
    displayName: '瓦片图层',
    description: '用于栅格瓦片服务展示',
    type: 'Layer',
    icon: ICON,
    color: '#5558db',
  },
  defaultVisConfig: {
    visible: true,
    zIndex: 0,
    style: {
      opacity: 1,
    },
    minZoom: 0,
    maxZoom: 24,
    blend: 'normal',
  },
  component,
  registerForm,
});
