import type { TooltipPlacement } from 'antd/es/tooltip';
import React from 'react';

/** 组件名称, 前缀 */
export const CLS_PREFIX = 'li-map-view-setting-control';

/**气泡定位位置数据 */
export const POPOVER_PLACEMENT_MAP = new Map<string | undefined, TooltipPlacement>([
  ['topleft', 'rightTop'],
  ['topcenter', 'bottom'],
  ['topright', 'leftTop'],
  ['bottomleft', 'rightBottom'],
  ['bottomcenter', 'top'],
  ['bottomright', 'leftBottom'],
  ['leftcenter', 'right'],
  ['rightcenter', 'left'],
  [undefined, 'rightBottom'],
]);

// 图标
export const MapViewSettingControlSvg = () => (
  <svg viewBox="0 0 64 64" width="64px" height="64px" fill="currentcolor">
    <path
      fill="currentcolor"
      d="m52.98253,40.465802c-3.228081,0 -6.013093,2.120406 -6.64605,5.063657l-19.463432,0c0.221535,-1.898871 0,-3.797743 -0.632957,-5.285192c-0.632957,-1.487449 -1.708984,-2.753364 -3.228081,-3.797743l13.070565,-12.880678c0.854492,0.411422 1.708984,0.411422 2.563476,0.411422c3.861039,0 7.057472,-3.164786 7.057472,-6.962528c0.221535,-3.797743 -3.006546,-6.962528 -6.867585,-6.962528s-7.057472,3.164786 -7.057472,6.962528c0,0.854492 0.221535,1.898871 0.44307,2.531829l-14.779549,14.368127l-12.437608,12.247721c-0.632957,0.854492 -0.854492,1.487449 -0.854492,2.120406c0,0.411422 0,0.632957 0.221535,1.044379c0.44307,1.044379 1.487449,1.677336 2.563476,1.677336l40.477609,0c1.297562,1.677336 3.228081,2.943251 5.570023,2.943251c3.861039,0 6.867585,-2.943251 6.867585,-6.740994s-3.006546,-6.740994 -6.867585,-6.740994zm-35.129121,-0.854492c1.076027,0.632957 1.708984,1.487449 1.930519,2.310294c0.44307,0.854492 0.632957,1.898871 0.44307,2.943251l-7.722077,0l5.348488,-5.253544z"
    />
  </svg>
);
